import math

print("Lesson 4. Home task №1.")
"""
Учимся работать с формулами.
Используя модуль math, вычислите значения по следующим формулам.
Значения a, b, x ввести с клавиатуры, вывести 4 рассчитанных по формулам значения. 
Сделать красиво оформленные ввод и вывод данных.
"""
a = float(input("Введите число a: "))
b = float(input("Введите число b: "))
x = float(input("Введите число x: "))
print("Введенные числа: a =", a, " ,b =", b, ", x =", x)
print(" ")
y1 = pow(a, 2) / 3 + (pow(a, 2) + 4) / b + pow((pow(a, 2) + 4), (1 / 2)) / 4 + pow(pow((pow(a, 2) + 4), 3), (1 / 2)) / 4
y2 = math.cos(x) + math.sin(x)
y3 = ((math.cos(x ** 2)) ** 2 + (math.sin(2 * x - 1)) ** 2) ** (1 / 3)
y4 = 5 * x + 3 * pow(x, 2) * pow((1 + pow((math.sin(x)), 2)), (1 / 2))

print("""a) Результат выполнения по формуле №1:
            y = (a**2)/3+(a**2+4)/b + ((a**2+4)**(1/2))/4 + (((a**2+4)**3)**(1/2))/4=""", y1)

print("""b) Результат выполнения по формуле №2:
            y = cos(x) + sin(x)=""", y2)

print("""с) Результат выполнения по формуле №3:
            y = (cos(x**2)**2+sin(2*x-1)**2)**(1/3)=""", y3)

print("""d) Результат выполнения по формуле №4:
            y = 5*x+3*(x**2)*(1+(sin(x))**2)*(1/2)=""", y4)

print("Ответ:")
print("a)", y1)
print("b)", y2)
print("c)", y3)
print("d)", y4)
